AcaApi.Poc/soap_unsigned.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Action xmlns="http://www.w3.org/2005/08/addressing">BulkRequestTransmitter</Action>
    <To xmlns="http://www.w3.org/2005/08/addressing">https://la.www4.irs.gov/airp/aca/a2a/1095BC_Transmission_AATS</To>
    <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <Timestamp p4:Id="_1" xmlns:p4="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <p4:Created>2025-09-30T18:59:48.8260846Z</p4:Created>
        <p4:Expires>2025-09-30T19:04:48.8264506Z</p4:Expires>
      </Timestamp>
    </Security>
    <ACASecurityHeader xmlns="urn:us:gov:treasury:irs:msg:acasecurityheader">
      <UserId xmlns="urn:us:gov:treasury:irs:common">your_asid_here</UserId>
    </ACASecurityHeader>
    <ACABusinessHeader xmlns="urn:us:gov:treasury:irs:msg:acabusinessheader">
      <UniqueTransmissionId xmlns="urn:us:gov:treasury:irs:ext:aca:air:ty25">3081794f-ea48-47b7-8846-2999abe929de::T</UniqueTransmissionId>
      <Timestamp xmlns="urn:us:gov:treasury:irs:common">2025-09-30T18:59:48.8264787Z</Timestamp>
    </ACABusinessHeader>
    <ACATransmitterManifestReqDtl xmlns="urn:us:gov:treasury:irs:ext:aca:air:ty25">
      <PaymentYr>2025</PaymentYr>
      <PriorYearDataInd>0</PriorYearDataInd>
      <EIN xmlns="urn:us:gov:treasury:irs:common">00-1234567</EIN>
      <TransmissionTypeCd>O</TransmissionTypeCd>
      <TestFileCd>T</TestFileCd>
      <TransmitterNameGrp>
        <BusinessNameLine1Txt>EBS Test Corp</BusinessNameLine1Txt>
      </TransmitterNameGrp>
      <CompanyInformationGrp>
        <CompanyNm>EBS Test Corp</CompanyNm>
        <MailingAddressGrp>
          <USAddressGrp>
            <AddressLine1Txt>123 Main St</AddressLine1Txt>
            <CityNm xmlns="urn:us:gov:treasury:irs:common">Anytown</CityNm>
            <USStateCd>TX</USStateCd>
            <USZIPCd xmlns="urn:us:gov:treasury:irs:common">75000</USZIPCd>
          </USAddressGrp>
        </MailingAddressGrp>
        <ContactPhoneNum>555-555-1212</ContactPhoneNum>
      </CompanyInformationGrp>
      <VendorInformationGrp>
        <VendorNm>Gemini Software</VendorNm>
        <ContactNameGrp>
          <PersonFirstNm xmlns="urn:us:gov:treasury:irs:common">Jane</PersonFirstNm>
          <PersonLastNm xmlns="urn:us:gov:treasury:irs:common">Smith</PersonLastNm>
        </ContactNameGrp>
        <ContactPhoneNum>800-555-1212</ContactPhoneNum>
      </VendorInformationGrp>
      <TotalPayeeRecordCnt>1</TotalPayeeRecordCnt>
      <TotalPayerRecordCnt>1</TotalPayerRecordCnt>
      <SoftwareId>25A0000</SoftwareId>
      <FormTypeCd>1094C</FormTypeCd>
    </ACATransmitterManifestReqDtl>
  </soap:Header>
  <soap:Body>
    <ACABulkRequestTransmitter xmlns="urn:us:gov:treasury:irs:msg:irsacabulkrequesttransmitter">
      <BulkExchangeFile xmlns="urn:us:gov:treasury:irs:common">
        <Include href="cid:4ea00724-5b18-4dfb-9e4e-5a0b5ffd7252" xmlns="http://www.w3.org/2004/08/xop/include" />
      </BulkExchangeFile>
    </ACABulkRequestTransmitter>
  </soap:Body>
</soap:Envelope>